atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    // We only listen to NETCONN_EVT_RCVPLUS events
    // NETCONN_EVT_RCVPLUS means it's safe to perform a potentially call once
    // more. However, two data events (with len > 0) may be processed by a single
    // netconn_recv. So we're sending len as well to address the case where len
    // is equal to 0 and netconn_recv will return an error.
    if (evt == NETCONN_EVT_RCVPLUS) {
        struct NetconnEvent event;
        event.netconn = netconn;
        event.len = len;

        BaseType_t xHigherPriorityTaskWoken;
        int result = xQueueSendFromISR(netconn_events, &event, &xHigherPriorityTaskWoken);
        if (result != pdTRUE) {
            fprintf(stderr, "socket: failed to enqueue: %i to netconn_events.\n", result);
        }

        result = xQueueSendFromISR(event_queue, &netconn_events, &xHigherPriorityTaskWoken);
        if (result != pdTRUE) {
            fprintf(stderr, "socket: failed to enqueue: %i to event_queue.\n", result);
        }
    }
}

// The scheduler is built in such a way that only one scheduler thread executes
// this function. So we don't need to protect the list of sockets.
EventListener *socket_events_handler(GlobalContext *glb, EventListener *listener)
{
    TRACE("socket_events_handler\n");

    struct ESP32PlatformData *platform = glb->platform_data;

    struct NetconnEvent event;
    while (xQueueReceive(netconn_events, &event, 1) == pdTRUE) {
        TRACE("Got netconn: %p, len = %d\n", (void *) event.netconn, event.len);
        struct SocketData *socket = NULL;
        int32_t socket_process_id = 0;
        struct ListHead *socket_head;
        struct ListHead *socket_list = synclist_rdlock(&platform->sockets);
        LIST_FOR_EACH (socket_head, socket_list) {
            struct SocketData *current_socket = GET_LIST_ENTRY(socket_head, struct SocketData, sockets_head);
            if (current_socket->conn == event.netconn) {
                socket = current_socket;
                socket_process_id = current_socket->process_id;
                break;
            }
        }

        if (socket == NULL) {
            if (event.len == 0) {
                // The socket may already be gone
                TRACE("Got event for unknown conn: %p, dropping it as len is 0\n", (void *) event.netconn);
            } else {
                // Add it to ready_connections
                TRACE("Got event for unknown conn: %p, len = %d adding to ready connections list\n", (void *) event.netconn, event.len);
                struct ReadyConnection *ready = (struct ReadyConnection *) malloc(sizeof (struct ReadyConnection));
                if (IS_NULL_PTR(ready)) {
                    AVM_ABORT();
                }
                ready->netconn = event.netconn;
                ready->len = event.len;
                list_append(&platform->ready_connections, &ready->ready_connection_head);
            }
        }
        synclist_unlock(&platform->sockets);

        if (socket != NULL) {
            BEGIN_WITH_STACK_HEAP(TUPLE_SIZE(2), heap)
            term message = term_alloc_tuple(2, &heap);
            term_put_tuple_element(message, 0, globalcontext_make_atom(glb, netconn_event_internal));
            term_put_tuple_element(message, 1, term_from_int(event.len));
            globalcontext_send_message(glb, socket_process_id, message);
            END_WITH_STACK_HEAP(heap, glb)
        }
    }
    return listener;
}

void socket_driver_init(GlobalContext *glb)
{
    TRACE("Initializing socket driver\n");

    netconn_events = xQueueCreate(32, sizeof(struct NetconnEvent));
    EventListener *socket_listener = malloc(sizeof(EventListener));

    struct ESP32PlatformData *platform = glb->platform_data;
    platform->socket_listener = socket_listener;
    socket_listener->sender = netconn_events;
    socket_listener->handler = socket_events_handler;
    sys_register_listener(glb, socket_listener);

    synclist_init(&platform->sockets);
    list_init(&platform->ready_connections);

    TRACE("Socket driver init: done\n");
}

void socket_driver_destroy(GlobalContext *glb)
{
    TRACE("Destroying socket driver\n");

    struct ESP32PlatformData *platform = glb->platform_data;
    EventListener *socket_listener = platform->socket_listener;
    sys_unregister_listener(glb, socket_listener);
    vQueueDelete(socket_listener->sender);
    free((void *) socket_listener);

    synclist_destroy(&platform->sockets);

    TRACE("Socket driver destroy: done\n");
}

static struct ListHead *socket_data_preinit(struct ESP32PlatformData *platform)
{
    TRACE("socket_data_preinit\n");

    return synclist_wrlock(&platform->sockets);
}

static void socket_data_postinit(struct ESP32PlatformData *platform)
{
    TRACE("socket_data_postinit\n");

    synclist_unlock(&platform->sockets);
}

static void socket_data_init(struct SocketData *data, Context *ctx, struct netconn *conn,
    enum socket_type type, struct ListHead *sockets)
{
    TRACE("socket_data_init\n");

    data->type = type;
    data->conn = conn;
    data->process_id = ctx->process_id;
    data->controlling_process_pid = 0;
    data->port = 0;
    data->avail_bytes = 0;
    data->active = true;
    data->binary = true;
    data->read_condition = false;
    data->buffer = 512;

    list_append(sockets, &data->sockets_head);
    data->passive_receiver_process_pid = 0;
    data->passive_ref_ticks = 0;

    ctx->platform_data = data;
}

static struct TCPServerSocketData *tcp_server_socket_data_new(Context *ctx, struct netconn *conn,
    struct ListHead *sockets)
{
    struct TCPServerSocketData *tcp_data = malloc(sizeof(struct TCPServerSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPServerSocket, sockets);
    tcp_data->ready_connections = 0;
    list_init(&tcp_data->accepters_list_head);

    return tcp_data;
}

static struct TCPClientSocketData *tcp_client_socket_data_new(Context *ctx, struct netconn *conn,
    struct ListHead *sockets, int32_t controlling_process_pid)
{
    struct TCPClientSocketData *tcp_data = malloc(sizeof(struct TCPClientSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPClientSocket, sockets);
    tcp_data->socket_data.controlling_process_pid = controlling_process_pid;

    return tcp_data;
}

static struct UDPSocketData *udp_socket_data_new(Context *ctx, struct netconn *conn,
    struct ListHead *sockets, int32_t controlling_process_pid)
{
    struct UDPSocketData *udp_data = malloc(sizeof(struct UDPSocketData));
    if (IS_NULL_PTR(udp_data)) {
        return NULL;
    }
    socket_data_init(&udp_data->socket_data, ctx, conn, UDPSocket, sockets);
    udp_data->socket_data.controlling_process_pid = controlling_process_pid;

