atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    return udp_data;
}

// When this method is called, ensure free was called with REPLY_SIZE
#define REPLY_SIZE (TUPLE_SIZE(2) + TERM_BOXED_REFERENCE_SHORT_SIZE)
static void do_send_reply(Context *ctx, term reply, uint64_t ref_ticks, int32_t pid)
{
    GlobalContext *glb = ctx->global;
    term reply_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(reply_tuple, 0, term_from_ref_ticks(ref_ticks, &ctx->heap));
    term_put_tuple_element(reply_tuple, 1, reply);
    globalcontext_send_message(glb, pid, reply_tuple);
}

// Encode both LWIP errors and some internal errors
// (for example ealready if caller tries to call a passive socket twice)
static term lwip_error_atom(GlobalContext *glb, err_t status)
{
    switch (status) {
        case ERR_MEM:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "err_mem"));
        case ERR_BUF:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "err_buf"));
        case ERR_TIMEOUT:
            return globalcontext_make_atom(glb, ATOM_STR("\x9", "etimedout"));
        case ERR_WOULDBLOCK:
            return globalcontext_make_atom(glb, ATOM_STR("\xB", "ewouldblock"));
        case ERR_USE:
            return globalcontext_make_atom(glb, ATOM_STR("\xA", "eaddrinuse"));
        case ERR_ALREADY:
            return globalcontext_make_atom(glb, ATOM_STR("\x8", "ealready"));
        case ERR_CONN:
            return globalcontext_make_atom(glb, ATOM_STR("\x8", "enotconn"));
        case ERR_ABRT:
            return globalcontext_make_atom(glb, ATOM_STR("\xC", "econnaborted"));
        case ERR_RST:
            return globalcontext_make_atom(glb, ATOM_STR("\xA", "econnreset"));
        case ERR_ARG:
            return BADARG_ATOM;
        default:
            return globalcontext_make_atom(glb, ATOM_STR("\x7", "unknown"));
    }
}

static void do_send_error_reply(Context *ctx, err_t status, uint64_t ref_ticks, int32_t pid)
{
    GlobalContext *glb = ctx->global;
    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    term reason_atom = lwip_error_atom(glb, status);
    term error_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
    term_put_tuple_element(error_tuple, 1, reason_atom);
    do_send_reply(ctx, error_tuple, ref_ticks, pid);
}

static void purge_ready_connections(struct ESP32PlatformData *platform, struct netconn *conn)
{
    struct ListHead *item;
    struct ListHead *tmp;
    MUTABLE_LIST_FOR_EACH (item, tmp, &platform->ready_connections) {
        struct ReadyConnection *ready = GET_LIST_ENTRY(item, struct ReadyConnection, ready_connection_head);
        if (ready->netconn == conn) {
            list_remove(item);
            free(ready);
        }
    }
}

static err_t accept_conn(Context *ctx, struct TCPServerSocketData *tcp_data, uint64_t ref_ticks, int32_t pid)
{
    TRACE("Going to accept a TCP connection\n");
    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = ctx->global->platform_data;

    struct netconn *accepted_conn;

    // The accept is non-blocking: a spurious ready event (a stale event
    // carrying a recycled conn pointer) yields ERR_WOULDBLOCK and the caller
    // re-registers the accepter instead of blocking forever.
    // Note there is a bug in lwIP: the callbacks may be called before
    // netconn_accept is called; events received before the accepted socket
    // is published are kept in ready_connections and drained below.
    netconn_set_nonblocking(tcp_data->socket_data.conn, 1);
    err_t status = netconn_accept(tcp_data->socket_data.conn, &accepted_conn);
    if (UNLIKELY(status != ERR_OK)) {
        if (status != ERR_WOULDBLOCK) {
            do_send_error_reply(ctx, status, ref_ticks, pid);
        }
        return status;
    }

    TRACE("accepted conn: %p\n", (void *) accepted_conn);

    Context *new_ctx = context_new(glb);
    new_ctx->native_handler = socket_consume_mailbox;

    term socket_pid = term_port_from_local_process_id(new_ctx->process_id);

    struct ListHead *sockets = socket_data_preinit(platform);

    struct ListHead *ready_connections_head;
    struct ListHead *tmp;
    bool is_ready = false;
    u16_t ready_len = 0;
    MUTABLE_LIST_FOR_EACH (ready_connections_head, tmp, &platform->ready_connections) {
        struct ReadyConnection *ready_connection;
        ready_connection = GET_LIST_ENTRY(ready_connections_head, struct ReadyConnection, ready_connection_head);
        if (ready_connection->netconn == accepted_conn) {
            TRACE("found accepted conn in list of ready connections\n");
            is_ready = true;
            ready_len += ready_connection->len;
            list_remove(ready_connections_head);
            free(ready_connection);
        }
    }

    struct TCPClientSocketData *new_tcp_data = tcp_client_socket_data_new(new_ctx, accepted_conn, sockets, pid);
    socket_data_postinit(platform);
    if (IS_NULL_PTR(new_tcp_data)) {
        AVM_ABORT();
    }
    new_tcp_data->socket_data.active = tcp_data->socket_data.active;
    new_tcp_data->socket_data.binary = tcp_data->socket_data.binary;
    new_tcp_data->socket_data.buffer = tcp_data->socket_data.buffer;

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE + TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    term result_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(result_tuple, 0, OK_ATOM);
    term_put_tuple_element(result_tuple, 1, socket_pid);

    if (is_ready) {
        term message = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(message, 0, globalcontext_make_atom(glb, netconn_event_internal));
        term_put_tuple_element(message, 1, term_from_int(ready_len));
        globalcontext_send_message(glb, new_ctx->process_id, message);
    }

    do_send_reply(ctx, result_tuple, ref_ticks, pid);

    return ERR_OK;
}

static void do_accept(Context *ctx, const GenMessage *gen_message)
{
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (tcp_data->ready_connections) {
        TRACE("accepting existing connections.\n");

