atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
        if (accept_conn(ctx, tcp_data, ref_ticks, pid) == ERR_WOULDBLOCK) {
            tcp_data->ready_connections = 0;
        } else {
            tcp_data->ready_connections--;
            return;
        }
    }
    {
        struct TCPServerAccepter *accepter = malloc(sizeof(struct TCPServerAccepter));
        if (IS_NULL_PTR(accepter)) {
            AVM_ABORT();
        }
        accepter->accepting_process_pid = pid;
        accepter->ref_ticks = ref_ticks;
        list_append(&tcp_data->accepters_list_head, &accepter->accepter_head);
    }
}

static void do_send_passive_reply(Context *ctx, struct SocketData *socket_data, term reply)
{
    do_send_reply(ctx, reply, socket_data->passive_ref_ticks, socket_data->passive_receiver_process_pid);
    socket_data->passive_receiver_process_pid = 0;
    socket_data->passive_ref_ticks = 0;
}

static void do_send_socket_error(Context *ctx, err_t status)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;
    if (socket_data->active) {
        // udp active sockets do not send errors
        if (socket_data->type != UDPSocket) {
            // {tcp_error, {Moniker :: atom(), Socket :: pid(), Module :: module()}, Reason :: atom()}
            if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(3) + TUPLE_SIZE(3)) != MEMORY_GC_OK)) {
                AVM_ABORT();
            }
            term reason_atom = lwip_error_atom(glb, status);
            term result_tuple = term_alloc_tuple(3, &ctx->heap);
            term_put_tuple_element(result_tuple, 0, globalcontext_make_atom(glb, tcp_error_atom));
            term socket_pid = term_port_from_local_process_id(ctx->process_id);
            term socket_wrapper = create_tcp_socket_wrapper(socket_pid, &ctx->heap, glb);
            term_put_tuple_element(result_tuple, 1, socket_wrapper);
            term_put_tuple_element(result_tuple, 2, reason_atom);
            globalcontext_send_message(glb, socket_data->controlling_process_pid, result_tuple);
        }
    } else {
        do_send_error_reply(ctx, status, socket_data->passive_ref_ticks, socket_data->passive_receiver_process_pid);
        socket_data->passive_receiver_process_pid = 0;
        socket_data->passive_ref_ticks = 0;
    }
}

static void do_send_tcp_closed(Context *ctx)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;
    if (socket_data->active) {
        // {tcp_closed, {Moniker :: atom(), Socket :: pid(), Module :: module()}}
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + TUPLE_SIZE(3)) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        term result_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(result_tuple, 0, TCP_CLOSED_ATOM);
        term socket_pid = term_port_from_local_process_id(ctx->process_id);
        term socket_wrapper = create_tcp_socket_wrapper(socket_pid, &ctx->heap, glb);
        term_put_tuple_element(result_tuple, 1, socket_wrapper);
        globalcontext_send_message(glb, socket_data->controlling_process_pid, result_tuple);
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        term error_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_tuple, 1, CLOSED_ATOM);
        do_send_passive_reply(ctx, socket_data, error_tuple);
    }
}

static void do_tcp_server_netconn_event(Context *ctx)
{
    TRACE("do_tcp_server_netconn_event\n");
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    struct TCPServerAccepter *accepter = NULL;
    if (!list_is_empty(&tcp_data->accepters_list_head)) {
        struct ListHead *accepter_head = list_first(&tcp_data->accepters_list_head);
        accepter = GET_LIST_ENTRY(accepter_head, struct TCPServerAccepter, accepter_head);
        list_remove(accepter_head);
    }

    if (accepter) {
        if (accept_conn(ctx, tcp_data, accepter->ref_ticks, accepter->accepting_process_pid)
            == ERR_WOULDBLOCK) {
            // Spurious wake-up: keep waiting for a real connection.
            list_append(&tcp_data->accepters_list_head, &accepter->accepter_head);
        } else {
            free(accepter);
        }
    } else {
        tcp_data->ready_connections++;
    }
}

static NativeHandlerResult do_receive_data(Context *ctx)
{
    // Common case where socket is active or passive receiver is waiting
    struct netbuf *buf = NULL;
    struct SocketData *socket_data = ctx->platform_data;
    err_t status = netconn_recv(socket_data->conn, &buf);
    if (status != ERR_OK) {
        if (socket_data->type == TCPClientSocket) {
            // Close socket in case of errors or finish closing if it's closed
            // on the other end.
            struct ESP32PlatformData *platform = ctx->global->platform_data;
            struct netconn *closed_conn = socket_data->conn;
            struct ListHead *sockets_head = synclist_wrlock(&platform->sockets);
            UNUSED(sockets_head);
            socket_data->conn = NULL;
            list_remove(&socket_data->sockets_head);
            purge_ready_connections(platform, closed_conn);
            synclist_unlock(&platform->sockets);
            if (UNLIKELY(netconn_close(closed_conn) != ERR_OK)) {
                TRACE("do_receive_data: netconn_close failed\n");
            }
            if (UNLIKELY(netconn_delete(closed_conn) != ERR_OK)) {
                TRACE("do_receive_data: netconn_delete failed\n");
            }
        }
        if (socket_data->type == TCPClientSocket && (status == ERR_CLSD || status == ERR_CONN)) {
            do_send_tcp_closed(ctx);
        } else {
            TRACE("do_receive_data: netconn_recv error: %i\n", status);
            // Send an error packet.
            do_send_socket_error(ctx, status);
        }
        return NativeTerminate;
    }

    // This only retrieves the first chunk of buf
    netbuf_first(buf);
    void *data;
    u16_t data_len;
    status = netbuf_data(buf, &data, &data_len);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("do_receive_data: netbuf_data error: %i\n", status);
        netbuf_delete(buf);
        do_send_socket_error(ctx, status);
        return NativeContinue;
    }
    socket_data->avail_bytes -= data_len;
    socket_data->read_condition = false;

    TRACE("%*s\n", (int) data_len, (char *) data);

