atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    do_send_reply(ctx, OK_ATOM, ref_ticks, pid);
}

// Required for compatibility with existing erlang libraries
// TODO: remove this when not required anymore
static void do_init(Context *ctx, const GenMessage *gen_message)
{
    if (UNLIKELY(term_get_tuple_arity(gen_message->req) < 2)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term params = term_get_tuple_element(gen_message->req, 1);

    if (interop_proplist_get_value_default(params, LISTEN_ATOM, FALSE_ATOM) == TRUE_ATOM) {
        TRACE("listen\n");
        do_listen(ctx, gen_message);

    } else if (interop_proplist_get_value_default(params, CONNECT_ATOM, FALSE_ATOM) == TRUE_ATOM) {
        TRACE("connect\n");
        do_connect(ctx, gen_message);

    } else if (interop_proplist_get_value_default(params, PROTO_ATOM, FALSE_ATOM) == UDP_ATOM) {
        TRACE("udp_open\n");
        do_udp_open(ctx, gen_message);
    }
}

static void do_send(Context *ctx, const GenMessage *gen_message)
{
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (UNLIKELY(term_get_tuple_arity(gen_message->req) != 2)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term data = term_get_tuple_element(gen_message->req, 1);

    size_t buffer_size;
    switch (interop_iolist_size(data, &buffer_size)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            fprintf(stderr, "error: failed alloc.\n");
            return;
        case InteropBadArg:
            fprintf(stderr, "error: invalid iolist.\n");
            return;
    }
    void *buffer = malloc(buffer_size);
    switch (interop_write_iolist(data, buffer)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            free(buffer);
            fprintf(stderr, "error: failed alloc.\n");
            return;
        case InteropBadArg:
            free(buffer);
            fprintf(stderr, "error: invalid iolist.\n");
            return;
    }
    err_t status = netconn_write(tcp_data->socket_data.conn, buffer, buffer_size, NETCONN_COPY);
    free(buffer);
    if (UNLIKELY(status != ERR_OK)) {
        fprintf(stderr, "write error: %i\n", status);
        return;
    }

    if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    do_send_reply(ctx, OK_ATOM, ref_ticks, pid);
}

static void do_sendto(Context *ctx, const GenMessage *gen_message)
{
    struct UDPSocketData *udp_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (UNLIKELY(term_get_tuple_arity(gen_message->req) != 4)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term cmd = gen_message->req;
    term dest_addr_term = term_get_tuple_element(cmd, 1);
    term dest_port_term = term_get_tuple_element(cmd, 2);
    term data = term_get_tuple_element(cmd, 3);

    size_t buffer_size;
    switch (interop_iolist_size(data, &buffer_size)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            do_send_error_reply(ctx, ERR_MEM, ref_ticks, pid);
            return;
        case InteropBadArg:
            do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
            return;
    }
    void *buffer = malloc(buffer_size);
    switch (interop_write_iolist(data, buffer)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            free(buffer);
            do_send_error_reply(ctx, ERR_MEM, ref_ticks, pid);
            return;
        case InteropBadArg:
            free(buffer);
            do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
            return;
    }

    ip_addr_t ip4addr;
    tuple_to_ip_addr(dest_addr_term, &ip4addr);
    uint16_t destport = term_to_int32(dest_port_term);

    struct netbuf *sendbuf = netbuf_new();

    err_t status = netbuf_ref(sendbuf, buffer, buffer_size);
    if (UNLIKELY(status != ERR_OK)) {
        netbuf_delete(sendbuf);
        free(buffer);
        do_send_error_reply(ctx, status, ref_ticks, pid);
        return;
    }

    status = netconn_sendto(udp_data->socket_data.conn, sendbuf, &ip4addr, destport);
    netbuf_delete(sendbuf);
    free(buffer);

    if (UNLIKELY(status != ERR_OK)) {
        do_send_error_reply(ctx, status, ref_ticks, pid);
        return;
    }

    if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    do_send_reply(ctx, OK_ATOM, ref_ticks, pid);
}

static void do_close(Context *ctx, const GenMessage *gen_message)
{
    struct SocketData *socket_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    struct netconn *closed_conn = socket_data->conn;
    struct ESP32PlatformData *platform = ctx->global->platform_data;
    struct ListHead *sockets_head = synclist_wrlock(&platform->sockets);
    UNUSED(sockets_head);
    socket_data->conn = NULL;
    list_remove(&socket_data->sockets_head);
    purge_ready_connections(platform, closed_conn);
    synclist_unlock(&platform->sockets);

    err_t close_disconnect_res = 0;
    if (socket_data->type == UDPSocket) {
        close_disconnect_res = netconn_disconnect(closed_conn);
    } else if (socket_data->type == TCPClientSocket) {
        close_disconnect_res = netconn_close(closed_conn);
    }
    err_t delete_res = netconn_delete(closed_conn);

    if (UNLIKELY(close_disconnect_res != ERR_OK)) {
        do_send_error_reply(ctx, close_disconnect_res, ref_ticks, pid);
    } else if (UNLIKELY(delete_res != ERR_OK)) {
        do_send_error_reply(ctx, delete_res, ref_ticks, pid);
    } else {
        do_send_reply(ctx, OK_ATOM, ref_ticks, pid);
    }
}

static NativeHandlerResult do_recvfrom(Context *ctx, const GenMessage *gen_message)
{
    struct SocketData *socket_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

