atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    // We cannot stack blocked queries
    if (socket_data->passive_receiver_process_pid != 0) {
        do_send_error_reply(ctx, ERR_ALREADY, ref_ticks, pid);
        return NativeContinue;
    }

    socket_data->passive_receiver_process_pid = pid;
    socket_data->passive_ref_ticks = ref_ticks;

    // There may be nothing to read.
    if (socket_data->avail_bytes <= 0 && !socket_data->read_condition) {
        return NativeContinue;
    }

    return do_receive_data(ctx);
}

static void do_get_port(Context *ctx, const GenMessage *gen_message)
{
    struct SocketData *socket_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (socket_data->port == 0) {
        do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        term ok_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, term_from_int(socket_data->port));
        do_send_reply(ctx, ok_tuple, ref_ticks, pid);
    }
}

static void do_sockname(Context *ctx, const GenMessage *gen_message)
{
    struct SocketData *socket_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    ip_addr_t addr;
    u16_t port;
    err_t result = netconn_addr(socket_data->conn, &addr, &port);
    term return_msg;
    if (result != ERR_OK) {
        do_send_error_reply(ctx, result, ref_ticks, pid);
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) * 2 + SOCKET_INET_ADDR + REPLY_SIZE) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, &ctx->heap);
        term addr_term = socket_addr_to_tuple(&ctx->heap, &addr);
        term port_term = term_from_int(port);
        term address_port_term = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(address_port_term, 0, addr_term);
        term_put_tuple_element(address_port_term, 1, port_term);
        term_put_tuple_element(return_msg, 0, OK_ATOM);
        term_put_tuple_element(return_msg, 1, address_port_term);
        do_send_reply(ctx, return_msg, ref_ticks, pid);
    }
}

static void do_peername(Context *ctx, const GenMessage *gen_message)
{
    struct SocketData *socket_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    ip_addr_t addr;
    u16_t port;
    err_t result = netconn_peer(socket_data->conn, &addr, &port);
    term return_msg;
    if (result != ERR_OK) {
        do_send_error_reply(ctx, result, ref_ticks, pid);
    } else {
        // {ok, {{A,B,C,D}, Port}}
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) * 2 + SOCKET_INET_ADDR + REPLY_SIZE) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, &ctx->heap);
        term addr_term = socket_addr_to_tuple(&ctx->heap, &addr);
        term port_term = term_from_int(port);
        term address_port_term = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(address_port_term, 0, addr_term);
        term_put_tuple_element(address_port_term, 1, port_term);
        term_put_tuple_element(return_msg, 0, OK_ATOM);
        term_put_tuple_element(return_msg, 1, address_port_term);
        do_send_reply(ctx, return_msg, ref_ticks, pid);
    }
}

static void do_controlling_process(Context *ctx, const GenMessage *gen_message)
{
    struct SocketData *socket_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (UNLIKELY(term_get_tuple_arity(gen_message->req) != 2)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term new_pid_term = term_get_tuple_element(gen_message->req, 1);
    if (UNLIKELY(!term_is_local_pid(new_pid_term))) {
        do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
    } else {
        term return_msg;

        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }

        if (UNLIKELY(pid != socket_data->controlling_process_pid)) {
            return_msg = term_alloc_tuple(2, &ctx->heap);
            term_put_tuple_element(return_msg, 0, ERROR_ATOM);
            term_put_tuple_element(return_msg, 1, NOT_OWNER_ATOM);
        } else {
            int32_t new_pid = term_to_local_process_id(new_pid_term);
            socket_data->controlling_process_pid = new_pid;
            return_msg = OK_ATOM;
        }
        do_send_reply(ctx, return_msg, ref_ticks, pid);
    }
}

static NativeHandlerResult socket_consume_mailbox(Context *ctx)
{
    TRACE("START socket_consume_mailbox\n");
    GlobalContext *glb = ctx->global;

    while (mailbox_has_next(&ctx->mailbox)) {
        Message *message = mailbox_first(&ctx->mailbox);
        term msg = message->message;

        TRACE("message: ");
        #ifdef ENABLE_TRACE
            term_display(stdout, msg, ctx);
        #endif
        TRACE("\n");

        if (term_is_tuple(msg) && term_get_tuple_element(msg, 0) == globalcontext_make_atom(glb, netconn_event_internal)) {
            if (IS_NULL_PTR(ctx->platform_data)) {
                // Event for a connection whose init failed and was deleted.
                mailbox_remove_message(&ctx->mailbox, &ctx->heap);
                continue;
            }
            int len = term_to_int32(term_get_tuple_element(msg, 1));
            NativeHandlerResult result = do_netconn_event(ctx, len);
            if (result == NativeTerminate) {
                // We don't need to remove message.
                return NativeTerminate;
            }
            mailbox_remove_message(&ctx->mailbox, &ctx->heap);
            continue;
        }

        GenMessage gen_message;
        if (UNLIKELY((port_parse_gen_message(msg, &gen_message) != GenCallMessage)
                || !term_is_tuple(gen_message.req) || term_get_tuple_arity(gen_message.req) < 1)) {
            ESP_LOGW(TAG, "Received invalid message.");
            mailbox_remove_message(&ctx->mailbox, &ctx->heap);
            return NativeContinue;
        }

        term cmd_name = term_get_tuple_element(gen_message.req, 0);

        switch (cmd_name) {
            //TODO: remove this
            case INIT_ATOM:
                TRACE("init\n");
                do_init(ctx, &gen_message);
                if (IS_NULL_PTR(ctx->platform_data)) {
                    return NativeTerminate;
                }
                break;

            case SENDTO_ATOM:
                TRACE("sendto\n");
                do_sendto(ctx, &gen_message);
                break;

