atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
            case SEND_ATOM:
                TRACE("send\n");
                do_send(ctx, &gen_message);
                break;

            case RECVFROM_ATOM:
                TRACE("recvfrom\n");
                if (do_recvfrom(ctx, &gen_message) == NativeTerminate) {
                    return NativeTerminate;
                }
                break;

            case RECV_ATOM:
                TRACE("recv\n");
                if (do_recvfrom(ctx, &gen_message) == NativeTerminate) {
                    return NativeTerminate;
                }
                break;

            case ACCEPT_ATOM:
                TRACE("accept\n");
                do_accept(ctx, &gen_message);
                break;

            case CLOSE_ATOM:
                TRACE("close\n");
                do_close(ctx, &gen_message);
                // We don't need to remove message.
                return NativeTerminate;

            case GET_PORT_ATOM:
                TRACE("get_port\n");
                do_get_port(ctx, &gen_message);
                break;

            case SOCKNAME_ATOM:
                TRACE("sockname\n");
                do_sockname(ctx, &gen_message);
                break;

            case PEERNAME_ATOM:
                TRACE("peername\n");
                do_peername(ctx, &gen_message);
                break;

            case CONTROLLING_PROCESS_ATOM:
                TRACE("controlling_process\n");
                do_controlling_process(ctx, &gen_message);
                break;

            default:
                TRACE("badarg\n");
                break;
        }

        mailbox_remove_message(&ctx->mailbox, &ctx->heap);
    }
    TRACE("END socket_consume_mailbox\n");
    return NativeContinue;
}

static Context *socket_driver_create_port(GlobalContext *global, term opts)
{
    UNUSED(opts);

    Context *ctx = context_new(global);
    ctx->native_handler = socket_consume_mailbox;
    ctx->platform_data = NULL;
    return ctx;
}

REGISTER_PORT_DRIVER(socket, socket_driver_init, socket_driver_destroy, socket_driver_create_port)

#endif
